{"0":"Some of it has subtle messages about MJs feeling towards the press and also the obvious message of drugs are bad mkay.br br Visually impressive but of course this is all about Michael Jackson so unless you remotely like MJ in anyway then you are going to hate this and find it boring.\nBecause MJ overheard his plans Nah Joe Pescis character ranted that he wanted people to know it is he who is supplying drugs etc so i dunno maybe he just hates MJs music.br br Lots of cool things in this like MJ turning into a car and a robot and the whole Speed Demon sequence.","1":"We enjoyed the effort Mr. Hines put into being faithful to H.G. Wells classic novel and we found it to be very entertaining.","2":"A secret project mutating a primal animal using fossilized DNA like ¨Jurassik Park¨ and some scientists resurrect one of natures most fearsome predators the Sabretooth tiger or Smilodon .\nScientific ambition turns deadly however and when the high voltage fence is opened the creature escape and begins savagely stalking its prey  the human visitors  tourists and scientific.Meanwhile some youngsters enter in the restricted area of the security center and are attacked by a pack of large prehistorical animals which are deadlier and bigger .","3":"","4":"Superbly trashy and wondrously unpretentious 80s exploitation hooray The precredits opening sequences somewhat give the false impression that were dealing with a serious and harrowing drama but you need not fear because barely ten minutes later were up until our necks in nonsensical chainsaw battles rough fistfights lurid dialogs and gratuitous nudity Bo and Ingrid are two orphaned siblings with an unusually close and even slightly perverted relationship.\nVery few things in life ever made as little sense as the plot and narrative structure of White Fire but it sure is a lot of fun to watch.","5":"Eastwood is in good form as Dirty Harry and I liked Pat Hingle in this movie as the small town cop.","6":"I would avoid this movie.","7":"Sibrels smoking gun is a short video clip of the astronauts preparing a video broadcast.","8":"When the ships resident comedian  the shamelessly named Dickie due to his unfathomable success with the opposite gender  is presumed lost at sea Sandlers character Shecker gets his big break.","9":"br br This movie is full of references.","10":"","11":"His play just as well as the play of Mr. Edwards is clearly the top of all their profession.br br I recommend this film to be on your top 50 films to see and keep on your DVD shelves.","12":"We think like the teacher portrayed by Ben Miles of Coupling that we will be spoon fed a didactic lesson about religious tolerance but its much more about faith in people as well as God which is why the BBC showed it in England at Easter time and BBC America showed it in the U.S. over Christmas.br br Nathalie Press who was also so good in Summer of Love has a key role in Mr. Harveys redemption that could have been played for movieoftheweek preaching but is touching as they reach out to each other in an unexpected way unfortunately I saw their intense scene interrupted by commercials.br br While it is a bit heavyhanded in several times pointedly calling this road trip a pilgrimage this quiet film was the best evocation of good will towards men than Ive seen in most holidaythemed TV movies.","13":"Its nothing more than a B or Cgrade movie with just enough money to hire a couple talented cameramen and an OK sound designer.br br Like the previous poster said the problems seem to appear in postproduction ...voice dubbing etc.","14":"note to George Litman and others the Mystery Science Theater 3000 riff is I dont think so breeder.br br my favorite riff is Why were you looking at his like simply for the complete absurdity.","15":"The father Dale Midkiff then finds out about the Micmac burial ground beyond the pet cemetery that has powers of resurrection  only of course anything buried there comes back not quite RIGHT.br br Below average horror picture starts out clumsy insulting and inept and continues that way for a while with the absolute worst element being Midkiffs worthless performance.","16":"Not only does it have absolutely nothing to do with the plot but its also a pathetic excuse for porn and depressive dance music.br br The bullettime aspect of The Matrix was a good addition but in Reloaded they overuse to make it seem boring.\nIt appears that The Matrix franchise has quickly descended into the special effects drenched misfire that other franchises such as the Star Wars saga have.br br The acting standard is poor for the most part.\nbr br A poor throwntogether movie The Matrix Reloaded is a disappointment.\nEven in the movies own subgenre of special effect bonanzas Minority Report The Matrix etc.","17":"Ulli Lommels 1980 film The Boogey Man is no classic but its an above average low budget chiller thats worth a look.\nThe sequel 1983s Boogey Man II is ultimately a waste of time but at the very least its an entertaining one if not taken the least bit seriously.\nThough the opening title is Boogey Man 3 this is no sequel to those two far superior films I named above.\nIf there ever is another sequel which I doubt it then it needs to forget this one ever happened and be handled either by Lommel himself or someone who has at least some idea of how to make a decent horror film.br br My rating 15","18":"","19":"Some people may never feel loneliness at this level.br br Cheadles character Johnson reflected the total opposite of Sandlers character Fineman.","20":"The only form of food available is synthetic and distributed by the Soylent company.\nCharlton Heston in a great shape plays a cop investigating the murder of one of Soylents most eminent executives and he stumbles upon scandals and dark secrets...","21":"So he strolls through the Hollywood Hills stalking lovemaking couples at a distance ultimately shooting the men dead with a highpowered rifle with a scope.br br The seeming primary reason for this movies existence is to indulge in sexual activity over and over again.\nFor one thing Mike eyes the couples through the scope for minutes at a time before finally pulling the trigger.","22":"Sergeant Archibald Cutter Cary Grant of The Last Outpost Sergeant MacChesney Oscarwinner Victor McLaglen of The Informer and Sergeant Ballantine Douglas Fairbanks Jr. of The Dawn Patrol are a competitive trio of harddrinking hardbrawling and funloving Alpha males whose years of frolic are about to become history because Ballantine plans to marry Emmy Stebbins Joan Fontaine and enter the tea business.\nNaturally Cutter and MacChesney drum up assorted schemes to derail Ballentines plans.","23":"","24":"","25":"Nero was presented not so much as evil incarnate but as a wacky unfulfilled emperor who would rather have had a circus career.","26":"The scientists spend the entire movie wandering along this island and all of a sudden one of the girls starts itching madly from walking in the lush forest and just HAS to pour water on her feet to relive the itching which of course allows Paul to come out of the water and kill her.","27":"Can you imagine who hard it STINKS br br Who is the violent killer in this film and what are his motivations Well actually you couldnt possible care less.\nThe first victim dies directly in the first minute but nobody seems to mention or miss him afterwards so who cares  The rest of the actors...they dont deserve the term actors actually are completely uninteresting.","28":"I do not make this observation lightly \u0096 I am a major collector of videos gay and mainstream and I can state with some authority and without hesitation that BEN AND ARTHUR is quite simply the worst film I have ever sat through in my life.\nI hardly own every gay movie ever made but I am comfortable in stating that I pretty much purchase almost every gay video of interest that gets released and very often I buy videos without knowing anything about the film.\nSo when I read on the box that BEN AND ARTHUR concerned a conflict between gay lovers and the Christian Right one of my favorite subjects I decided to take the plunge sight unseen despite my previously disappointing purchase of another CULTURE Q CONNECTION title VISIONS OF SUGAR PLUMS.\nThis film almost made me sympathetic to the Christian Right \u0096 we are asked to believe not only that a church would expel a member because his brother is gay but that a priest would actually set up a mob style execution of a gay couple in order to save their souls like this even makes sense.\nThis film is enough to put off anybody from buying gay themed videos forever and the distributors should be ashamed of themselves.","29":"","30":"","31":"We completely understand why Kristen Dunst continues to talk to him despite his frequent screw ups.","32":"","33":"Eva Hedy Lamarr has just got married with an older man and in the honeymoon she realizes that her husband does not desire her.\nHer disappointment with the marriage and the privation of love makes Eva returning to her fathers home in a farm leaving her husband.\nI have just watched Extase for the first time and the first remark I have is relative to the horrible quality of the VHS released in Brazil by the Brazilian distributor Video Network the movie has only 75 minutes running time and it seems that it was used different reels of film.","34":"If one is going to commit to that sort of thing at least make it a good joke.....first off Jeroen Krabbé is i guess the poor mans Gerard Depardieu.....naturally i hate Gerard Depardieu even though he was very funny in the Iron Mask three musketeer one.\ndo you even care is it funny since Mr. Voerhoven is supposed to be a good film maker i will give him the benefit of the doubt and assume it was some misanthropic joke that got out of control.....though im guessing he didnt cast Jeroen Krabbé because hes the worst actor and every character hes played has been a pretentious bourgeois ass....\nDo you think Mr. Voerhoven did that on purpose and Jeroen Krabbé is the butt of the joke as well I just dont see it......","35":"Now saying that the visuals are the ONLY thing good in Sky Captain.br br After ten minutes I knew I was watching one of the worse movies of all time.\nYet this is only the second movie I felt like walking out of my entire life.br br Actingthere is none.\nEven the Phantom Menace had better acting and that is NOT saying a great deal.br br I would have to give this movie a 0 out of 10.","36":"","37":"In order for black comedy to work it must be outrageous which Play Dead is not.","38":"Kenneth Branaghs performance came close to stealing this movie from Helena Bonham Carter but their strong chemistry together made for a much more enjoyable movie.","39":"Ill dispense with the usual comparisons to a certain legendary filmmaker known for his neurotic New Yorker persona because quite frankly to draw comparisons with bumbling loser Josh Kornbluth is just an insult to any such director.\nIt was cruel to let it live and as a result audiences around the world are being made to suffer.br br The films premise \u0096 if indeed it has one \u0096 is not even worth discussing but for the sake of caution I will.\nThis did make me chuckle to myself but the moment soon passed and I was back to checking my watch for the remainder of the film.br br The films title is also a misnomer.\nDont be fooled into thinking this is an art house film because of its pretentioussounding title or the fact that it only played in a handful of cinemas and made no money at the box office\u0085\u0085\u0085 theres a very good reason for thatbr br ","40":"But the movie turned out to be a delightful and original surprise.br br You would at first expect that this is a normal average typical 30s movie with a formulaic lovestory but the movie is surprisingly well constructed and has an unusual and original story which also helps to make this movie a very pleasant one to watch.br br The story is carried by its two main characters played by Bette Davis and George Brent.","41":"That Nicholson falls for Turner is absurd but then again it is intended to be so.","42":"","43":"I dont know who Sue Kramer the director of this film is but I have a strong suspicion that A she is a lesbian and B she somehow shamed everyone involved in this project to participate to prove they are not homophobic.br br I can imagine everyone thinking My God this is horrible.\nThis is probably why Kramer did NOT cast gay people to play gay people too.","44":"Apparently back in 2007 when the dollar was stronger you could buy a super advanced stealth bomber that could go completely invisible for 75 million.\nThe camera would randomly zoom in on actors and skip to random scenes.","45":"","46":"","47":"I was at the same screenwriters conference and saw the movie.","48":"And thats being generous.br br First of all the casting for the movie was terrible.\nThe acting was so terrible that I was just simply waiting and hoping for the Godawful thing to end.br br Secondly there are points in the movie that had absolutely no relation to the plot whatsoever.","49":"I just love the whole 80s genre of these kind of movies because you dont see many like this one anymore I want to ask all of you people who say this movie is just a ripoff or a cheesy imitation what is it imitating Ive never seen another movie like this one well not horror anyway.br br Basically its about the popular group in school who like to make everyones lives living hell so they decided to pick on this nerdy boy named Marty.","50":"In this film he plays Cedric a local boy who meets vacationing Mathieu newcomer Jamie Elkaim in a stunning nuanced ethereal performance at the beach.","51":"","52":"The play isnt great to begin with and the decision to transfer it to film does it no favours  especially as Peploe doesnt decide how she wants to treat the materials theatrical origins we get occasional glances of an observing theatre audience etc.","53":"Last week I took a look at the weekly Nielsen ratings and there was Veronica Mars supposedly the best show youre not watching.br br Well theyre right that youre not watching it.","54":"","55":"It really continues the tired formula of the Highlander Series The hero immortal encounters another immortal with flashbacks about the last time they met but there is some conflict and there is a sword fight at the end where you have a cheap special effects sequence.br br Then you have the character of Nick Wolf.","56":"","57":"The story takes place in 1968 and its beautifully filmed in black  white almost a film noir style with its deep shadows and stark images.\nTaking on such a sensitive issue makes this episode all the more stunning.","58":"This movie was o.k. but it could have been much better.","59":"I knew it was a rough crime drama going in but being the first Cat. 3 Ive purchased thats been made recently I wasnt sure what to expect.br br A Cambodian hitman goes to Hong Kong to knock off the wife of a judge who is also a lawyer.\nAfter the hit the cops locate the hitman pretty fast but in trying to arrest him several police officers and civilians are killed.\nI loved this movie its like a rollercoaster that just keeps moving and moving at high speed as one incident leads to another and the police at times are just as bad or worse as the hitman.","60":"Four different stories involve people who either rent the home or investigate what happened to the tenants.br br The first segment starred Denholm Elliott as a horror writer who has writers block.\nThis all leads to an ending that frankly was a bit of a letdown.br br Christopher Lee then stars as an incredibly harsh and stern father to a pathetic little girl.\nI enjoyed Pertwees line when he basically said that Lees and other recent incarnations of Dracula were all crap compared to Bela Lugosis Perhaps this is why Lee didnt take this part Despite some very silly moments it was very entertaining and funpossibly as good or better than the first segment.br br Considering that the film started and ended so well had excellent acting and writing its hard not to like this film.","61":"The absolute gem of this film is without a doubt Alice Krige who plays Mary Brady the otherworldly mother.br br King manages to take a simple story of outsider or people who are a little differentokay  a lot in this case trying to fit in and twists it into a campy over the top little horror gem that has to be in the collection of any horror fan.","62":"I rented this movie because it falls under the genres of romance and western with some Grand Canyon scenery thrown in.","63":"With a cast that features Skippy from Family Ties Gene Simmons of Kiss and Ozzy Osbourne as a Preacher how can you go wrong Backwards evil messages played on vinyl Yes thats right they use records in this movie.","64":"They both dont try very hard to sound sarcastic when theyre saying stuff like My friends are going to be so jealous Hey whats with the killer only wearing his mask in the beginning Thats retarded I practically ignored the second half of this.","65":"","66":"The opening credits set the playful scene with kitsch late 1950s cartoon stills an enchanting Peres Prez Prado mambo theme which appears to be curiously uncredited but his grunts are unmistakable and noone else did them and with familiar cast names including Kathy Najimi a full year before she hit with Sister Acts 1  2 plus Teri Hatcher from TVs Superman.br br Every scene is imbued with shallow injustices flung at various actors actresses and producers in daytime TV.\nShe cries screeches and wrings her hands though the rest of the movie while her dresser Tawnee Kathy Najimi constantly waddling after Celeste unseen through Celestes fog of paranoia indulges a taste for Tammy Faye Baker for which Tawnee had been in fact specifically hired.br br Rosie Schwartz Whoopi Goldberg has seen it all before.\nSo when Celeste freaks Rosie offers to write her off the show for six months Well just say that Maggie went to visit with the Dalai Lama.\nOther well hidden member of the cast include Garry Marshall in real life Mr Happy Days and brother of Penny who gets paid 1.2 million to make the command decisions on The Sun Also Sets  he says he definitely likes peppy and cheap and Carrie Fisher as Betsy Faye Sharon whos a bitch.br br Geoffrey Anderson Kevin Kline is the yummywithaspoon and he is by the way dinner theater actor now rescued from his Hell by David Seaton Barnes Robert Downey Jr and brought back to the same show he was canned from 20 years earlier.\nSomehow they work out the logical difficulties and Geoffrey Anderson steps off the choochoo.br br Celeste can now only get worse and her trick of going across the Washington bridge no longer helps.\nYou try playing Willie Loman in front of a bunch of old farts eating meatloaf  And indeed seeing Geoffreys dinner theater lifestyle amongst all the hocking and accidents is hilarious.\nMontana Moorehead Cathy Moriarty is getting impatient waiting for her star to rise and is getting desperate for some publicity.br br Will her plots finally succeed Will Celeste settle her nerves or will she kill Tawnee first Will the producer get Mr Fuzzy Youll just have to watch  the second half  of this utterly lovable farcically malicious riot.br br And youll really have to see to believe how the shortsighted Geoffrey reads his lines without glasses live off the TelePrompter.","67":"","68":"However we learn that Wangs family tradition allows him only to pass his secrets to a son.\nTaking the advice to heart Wang purchases an 8 year old to fulfill his legacy he would teach his new son Doggie the ancient art of silk masks.","69":"The Cowboy and Twig ride up the ridge.","70":"I am a big fan of cinema verite and saw this movie because I heard how interesting it was.","71":"How do I begin to review a film that will soon be recognized as the worst film of all time by the worst director of all time A film that could develop a cult following because its so bad its goodbr br An analytical approach criticizing the film seems both pointless and part of bandwagon syndromelets bash freely without worry of backlash because every other human on earth is doing it and the people who like the film like it for those flaws wed cite.br br The films universal poor quality goes without saying Sixteen Years of Alcohol is not without competition for title of worst film so it has to sink pretty low to acquire the title and keep a hold of it but I believe this film could go the distance.\nSo bad its good No. It had just enough I cant believe this is a serious movie moments to keep me from turning it off and nothing more.br br Definitely a film to watch with a group of badmovie connoisseurs.","72":"","73":"Dont get me wrong about 1 every 10 jokes actually manages to be funny the iron  phone one is probably my favorite.","74":"","75":"If Manuel wins his friend will pay off his debt to a violent asian street gang  if he loses he must play bottom man to his friend br br Lots of raunchy dialogue fairly sick physical humour etc.","76":"Then you eat an underdone hotdog and throw up.br br All right Im being a little rough on a young director who might still go places  as I said the camera work is quite good.br br But I feel cheated  the blurb for this film suggests we will get to watch a Modern western and the DVD packaging has pictures on it that suggest this as well  but nobody actually connected to the films making seems to know that this is the kind of film theyre supposed to be making.br br That betrayal is what hurts but even without it the fact remains that we dont like these characters we feel embarrassed for the actors the story is hopelessly muddled and in the last analysis we just dont care.br br I took it out of the DVD player about half way through.","77":"He of course was brilliant as he almost always seemed to be in all of his movies.","78":"Except Asia Carreras sexual scene any sexual scene in this movie doesnt make me feel great you know what I mean.","79":"Several good songs enliven the film with the Twinkle in Your Eye number a total highlight including a fun jitterbug number between MacDonald and Binnie Barnes.","80":"If you are are looking for a funny movie that also makes you think I highly suggest you quickly run to your local video store and find this movie.","81":"Having to stay a spell due to her car breaking down she finds out that her great aunt left her 3 things a house a dog and a cookbook.\nSeems that the cookbook is a book of spells that will make him a more powerful warlock.br br The film is actually pretty funny with Peterson a.k.a. Elvira using her endowments and sexiness as a joke And dont forget tomorrow were showing the head with two things...","82":"But the cure is broken when Cruella hears the toll of Big Ben and she once again goes on a mad quest to make herself the perfect coat out of dalmation hides.br br This movie is bad on so many levels starting with the fact that its a Thanksgiving family schlock movie designed to suck every last available dime out of the Disney marketing machine.\nI have to admit the dogs were fairly good actors  much better than the humans.br br Gerard Depardieu is completely wasted in this movie as a freakedout French furrier.","83":"The cast assembled has enough talent to make almost any plot watchable and from what Ive been told the book is enjoyable.br br How then could this movie be so intolerably bad To begin with it seems the director brought together a cast of names with no other tie than what will bring in the 20 somethings.","84":"But I think that the fact that Louis Sachar was involved from the beginning helped masses so that the film sticks close to the story but takes it even further.\nThe transitions in time work well and capture the steady climax from the book leading up to the twists throughout the film.\nThe songs link to the story well and add extra jazz to the overall style of the film.\nIf youre going to buy the film I recommend you buy the soundtrack too especially for If Only which centres around the story and contains the chorus from the book.br br I do not work for the people who made Holes by the way Im just a fan plugging my favourite film and giving it the review it deserves.","85":"It was one of those I have to watch this because its so horribly bad moments like Roadhouse without the joy.\nIf it smells like...and it looks like...well you know the rest.br br Avoid like the plague.br br edit Apparently other more close minded reviewers believe that since I disliked this movie I am an obvious hater which I can only assume means I am phobic which of course is not true.","86":"This picture has a singular voice that will echo throughout the annuls of film history.br br The opening montage provides a splendid palette which helmer JP Sarro uses to establish his art on this canvas of entertainment.br br Sarro truly uses the camera as his paintbrush while he brings us along on a ride that envelops the audience in a tremendous action movie that goes beyond the traditional format we have become accustomed to and dives deeply into dark themes of betrayal revenge and the importance of companionship.\nA producers job is one of the hardest in any movie and Shipley makes it look easy.br br All in all this film combines creative writing stunning production and masterful direction.","87":"","88":"","89":"br br Avoid this one at all costs unless you revel in conflict.br br ","90":"No one normal would not behave the way the main character behaves.","91":"The miniseries was superb and it is unfortunate that DH should have gotten his hands on something unique and made it mundane.","92":"","93":"","94":"I only caught a few episodes about three before it was cancelled by ABC.","95":"","96":"Though shot on a small budget in NYC the film looks and sounds fabulous and takes us on a behind the scenes whirl through the rehearsal and mounting of what actors call The Scottish Play as a reference to the word Macbeth is thought to bring on the plays ancient curse.","97":"I cant understand how Ettore Scolaone of the greater directors of Italian cinema made a film like this so stupid and ridiculous All the stories of the people involved in the movie are unsubstantialboring and not interesting.","98":"As a big fan of David Mamets films and plays especially his first film House of Games that also starred Joe Mantegna I was expecting great things from this film.","99":"","100":"The US version of this show is everything that reality TV shouldnt be."}